Repository: AbelLykens/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/reference/env-settings.po
Languages: nl

source: Environment settings
nl: Environment-instellingen

source: Contents
nl: Inhoudsopgave

source: Django settings/overrides
nl: Django instellingen

source: DSMR-reader utilizes the Python Django framework. All settings below directly affect or override Django, and therefor your DSMR-reader installation as well.
nl: DSMR-reader gebruikt onderwater het Python Django framework. Alle instellingen hieronder hebben direct betrekking op Django en daarmee op je DSMR-reader-installatie.

source: You can either specify the following settings:
nl: Je kunt de volgende instellingen als volgt specificeren:

source: in a ``.env`` file in the root of the DSMR-reader project folder (manual installations)
nl: ofwel in een ``.env`` bestand in de bovenste map van de DSMR-reader-installatie (handmatige installaties)

source: or as system environments variables (Docker installations)
nl: of als een systeem environment variabele (Docker-installaties)

source: The secret key Django should use. This should be randomly generated for your installation. Generate or refresh it by running ``./tools/generate-secret-key.sh``.
nl: De secret key die Django gebruikt. Zou willekeurig moeten zijn voor je installatie. Genereer of roteer het door ``./tools/generate-secret-key.sh`` uit te voeren.

source: See ``SECRET_KEY`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#secret-key>`__.
nl: Zie ``SECRET_KEY`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#secret-key>`__.

source: **This setting is required**
nl: **Deze instelling is vereist**

source: Former ``SECRET_KEY`` env var.
nl: Voormalige ``SECRET_KEY`` env var.

source: The database engine to use. Officially DSMR-reader only supports ``django.db.backends.postgresql``, but others supported by Django may work as well. Experiment at your own risk!
nl: De database-engine om te gebruiken. Officieel ondersteunt DSMR-reader alleen ``django.db.backends.postgresql``, maar andere engines ondersteund door Django werken mogelijk ook. Experimenteer op eigen risico!

source: See ``DATABASES.ENGINE`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#engine>`__.
nl: Zie ``DATABASES.ENGINE`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#engine>`__.

source: Former ``DB_ENGINE`` env var.
nl: Voormalige ``DB_ENGINE`` env var.

source: See ``DATABASES.HOST`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#host>`__.
nl: Zie ``DATABASES.HOST`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#host>`__.

source: **This setting is required** for the default ``DJANGO_DATABASE_ENGINE``, but can be optional for some engines.
nl: **Deze instelling is vereist** voor de standaard ``DJANGO_DATABASE_ENGINE``, maar is mogelijk optioneel voor andere engines.

source: Former ``DB_HOST`` env var.
nl: Voormalige ``DB_HOST`` env var.

source: See ``DATABASES.PORT`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#port>`__.
nl: Zie ``DATABASES.PORT`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#port>`__.

source: Former ``DB_PORT`` env var.
nl: Voormalige ``DB_PORT`` env var.

source: See ``DATABASES.NAME`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#name>`__.
nl: Zie ``DATABASES.NAME`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#name>`__.

source: Former ``DB_NAME`` env var.
nl: Voormalige ``DB_NAME`` env var.

source: See ``DATABASES.USER`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#user>`__.
nl: Zie ``DATABASES.USER`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#user>`__.

source: Former ``DB_USER`` env var.
nl: Voormalige ``DB_USER`` env var.

source: See ``DATABASES.PASSWORD`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#password>`__.
nl: Zie ``DATABASES.PASSWORD`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#password>`__.

source: Former ``DB_PASS`` env var.
nl: Voormalige ``DB_PASS`` env var.

source: See ``DATABASES.CONN_MAX_AGE`` in `Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#conn-max-age>`__. Omit to use the default.
nl: Zie ``DATABASES.CONN_MAX_AGE`` in `Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#conn-max-age>`__. Laat weg om de standaard waarde te gebruiken.

source: **This setting is optional**
nl: **Deze instelling is optioneel**

source: Former ``CONN_MAX_AGE`` env var.
nl: Voormalige ``CONN_MAX_AGE`` env var.

source: The timezone Django should use. Alter at your own risk. Omit to use the default, using the CET/CEST timezone (applicable to the Netherlands).
nl: De tijdzone die Django moet gebruiken. Wijzig op eigen risico. Laat weg om de standaard CET/CEST-tijdzone te gebruiken (zoals die voor Nederland geldt).

source: See ``TIME_ZONE`` in `Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#std:setting-TIME_ZONE>`__.
nl: Zie ``TIME_ZONE`` in `Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#std:setting-TIME_ZONE>`__.

source: Former ``TZ`` env var.
nl: Voormalige ``TZ`` env var.

source: See ``STATIC_URL`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#static-url>`__. Omit to use the default.
nl: Zie ``STATIC_URL`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#static-url>`__. Laat weg om de standaardwaarde te gebruiken.

source: **This setting is situational**
nl: **Deze instelling is situationeel**

source: See ``FORCE_SCRIPT_NAME`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#force-script-name>`__. Omit to use the default.
nl: Zie ``FORCE_SCRIPT_NAME`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#force-script-name>`__. Laat weg om de standaardwaarde te gebruiken.

source: See ``USE_X_FORWARDED_HOST`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#use-x-forwarded-host>`__. Omit to use the default.
nl: Zie ``USE_X_FORWARDED_HOST`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#use-x-forwarded-host>`__. Laat weg om de standaardwaarde te gebruiken.

source: See ``USE_X_FORWARDED_PORT`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#use-x-forwarded-port>`__. Omit to use the default.
nl: Zie ``USE_X_FORWARDED_PORT`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#use-x-forwarded-port>`__. Laat weg om de standaardwaarde te gebruiken.

source: See ``X_FRAME_OPTIONS`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#x-frame-options>`__. Omit to use the default.
nl: Zie ``X_FRAME_OPTIONS`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#x-frame-options>`__. Laat weg om de standaardwaarde te gebruiken.

source: See ``STATIC_ROOT`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#static-root>`__. Omit to use the default.
nl: Zie ``STATIC_ROOT`` `in Django docs <https://docs.djangoproject.com/en/3.1/ref/settings/#static-root>`__. Laat weg om de standaardwaarde te gebruiken.

source: DSMR-reader settings
nl: DSMR-reader instellingen

source: These settings are for DSMR-reader only.
nl: Deze instellingen zijn alleen voor DSMR-reader.

source: The username of the **webinterface** (super)user to create when running ``./manage.py dsmr_superuser``.
nl: Gebruikersnaam van de **webinterface** (super)user om te gebruiken, wanneer je ``./manage.py dsmr_superuser`` uitvoert.

source: Former ``DSMR_USER`` env var.
nl: Voormalige ``DSMR_USER`` env var.

source: The password of the ``DSMRREADER_ADMIN_USER`` user to create (or update if the user exists) when running ``./manage.py dsmr_superuser``.
nl: Het gewenste wachtwoord voor de ``DSMRREADER_ADMIN_USER`` gebruiker, bij aanmaken of updaten van de gebruiker. Voor wanneer je ``./manage.py dsmr_superuser`` uitvoert.

source: Former ``DSMR_PASSWORD`` env var.
nl: Voormalige ``DSMR_PASSWORD`` env var.

source: The log level DSMR-reader should use. Choose either ``ERROR`` (omit for this default), ``WARNING`` or ``DEBUG`` (should be temporary due to file I/O).
nl: Het log level dat DSMR-reader gebruikt. Kies ofwel ``ERROR`` (laat weg voor deze standaardwaarde), ``WARNING`` of ``DEBUG`` (alleen tijdelijk i.v.m. hogere I/O).

source: For more information, :doc:`see Troubleshooting</how-to/troubleshooting/enabling-debug-logging>`.
nl: Voor meer informatie, :doc:`zie Hulp bij problemen</how-to/troubleshooting/enabling-debug-logging>`.

source: The plugins DSMR-reader should use. Omit to use the default of no plugins. Note that this should be a comma separated list when specifying multiple plugins. E.g.::
nl: De plugins die DSMR-reader gebruikt. Laat weg als je dit niet gebruikt. N.B.: Dit is een komma-gescheiden lijst wanneer je meerdere plugins specificeert. Bijvoorbeeld::

source: For more information, :doc:`see Plugins</reference/plugins>`.
nl: Voor meer informatie, :doc:`zie Plugins</reference/plugins>`.

source: Whether to suppress any warnings regarding too many readings stored or the database size. Set it to ``True`` to disable the warnings or omit it to use the default (``False``). Suppress at your own risk.
nl: Gebruik dit om waarschuwingen over "te veel opgeslagen metingen" of een "te grote database" te onderdrukken. Stel in op ``True`` om deze waarschuwingen uit te schakelen of laat het weg om de standaardwaarde (``False``) te gebruiken. Gebruik op eigen risico.

source: The maximum amount of MQTT messages queued in DSMR-reader until new ones will be rejected. This prevents creating an infinite backlog of messages queued.
nl: Het maximum aantal MQTT-berichten dat achtergehouden wordt totdat ze verzonden kunnen worden. Als dit maximum bereikt wordt, weigert DSMR-reader nieuwe MQTT-berichten. Dit voorkomt dat oneindig veel berichten zich opstapelen.

source: However, situationally you may increase the maximum for whatever reason along your local setup. Omit to use the default.
nl: Desondanks kan het zijn dat je specifiek in je eigen situatie een ander maximum wilt. Laat weg om de standaardwaarde te gebruiken.

source: (default value: ``5000``)
nl: (standaardwaarde: ``5000``)

source: (default value: ``500``)
nl: (standaardwaarde: ``500``)

source: DSMR-reader sends MQTT messages to your broker with a ``retain`` flag, resulting the broker keeping the last value received for every topic. Updating MQTT topics consecutively with the same value has no effect, depending on its usage. Therefor DSMR-reader can be set to cache the last value sent for each topic. It will cause DSMR-reader to **not** send the same value to the same topic consecutively.
nl: DSMR-reader stuurt MQTT-berichten naar je broker met een ``retain`` vlag. Dit zorgt ervoor dat de broker van elk topic de laatst ontvangen waarde bewaart. Het bijwerken van MQTT-topics met dezelfde waarde heeft doorgaans geen nut, afhankelijk van het gebruik. Daarom kan DSMR-reader ingesteld worden om de laatste waarde van elk topic te cachen. Dit zorgt ervoor dat DSMR-reader dezelfde waarde **niet** achtereenvolgend naar hetzelfde topic stuurt.

source: This was enabled by default in DSMR-reader ``v4.x``, but has been changed to being disabled by default since DSMR-reader ``v5.0``.
nl: Dit was standaard ingeschakeld in DSMR-reader ``v4.x``, maar is vanaf DSMR-reader ``v5.0`` standaard uitgeschakeld.

source: Set this value (cache duration in seconds) to > ``0`` to enable.
nl: Stel deze (cachingduur in seconden) op > ``0`` om in te schakelen.

source: (default value: ``0``)
nl: (standaardwaarde: ``0``)

source: (default value: ``3600``)
nl: (standaardwaarde: ``3600``)
