Repository: AbelLykens/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: nl

source: API Documentation
nl: API-documentatie

source: The application has an API allowing you to insert/create readings and retrieve statistics.
nl: De applicatie heeft een API waarmee metingen kunt aanmaken/opvragen en diverse statistieken uitlezen.

source: Contents
nl: Inhoudsopgave

source: Configuration & authentication
nl: Configuratie & authenticatie

source: Enable API
nl: API inschakelen

source: The API is disabled by default in the application. You may enable it in your configuration or admin settings.
nl: Standaard is de API in de applicatie uitgeschakeld. Je kunt deze inschakelen in het configuratiescherm of beheerderpaneel.

source: Example
nl: Voorbeeld

source: Authenticating
nl: Authenticatie

source: Besides allowing the API to listen for requests, you will also need send your API key with each request. The API key can be found on the same page as in the screenshot above. The application generates one for you initially, but feel free to alter the API key when required.
nl: Naast het inschakelen van de API, zul je bij elke request de API-key moeten meesturen. De API-key kun je inzien op dezelfde pagina's als die in de screenshot hierboven. De applicatie maakt standaard een API-key voor je aan. Deze kun je eventueel zelf wijzigen wanneer daar de behoefte voor is.

source: Examples
nl: Voorbeelden

source: Using ``cURL``::
nl: Met ``cURL``::

source: Using ``requests``::
nl: Met ``requests``::

source: This allows you to insert a raw telegram, into the application as if it was read locally using the serial cable.
nl: Dit staat je toe om een ruwe telegram aan de applicatie door te geven, wanneer je deze op afstand uitleest.

source: Since ``DSMR-reader v1.6`` this call now returns ``HTTP 201`` instead of ``HTTP 200`` when successful.
nl: Sinds ``DSMR-reader v1.6`` geeft deze call ``HTTP 201`` terug in plaats van ``HTTP 200``, wanneer succesvol.

source: Full path: ``/api/v1/datalogger/dsmrreading``
nl: Volledig pad: ``/api/v1/datalogger/dsmrreading``

source: ``telegram`` (*string*) - The raw telegram string containing all linefeeds ``\n``, and carriage returns ``\r``, as well!
nl: ``telegram`` (*string*) - De ruwe telegram tekenreeks inclusief alle regeleindes ``\n`` en 'carriage returns' ``\r``!

source: Response
nl: Respons (van de server)

source: ``HTTP 201`` on success, with empty body. Any other status code on failure.
nl: ``HTTP 201`` wanneer succesvol, met een lege respons. Elke andere status code bij falen.

source: (using the ``requests`` library available on PIP)::
nl: (met de ``requests`` tool beschikbaar in PIP)::

source: You can use a script to run in Supervisor. It will send telegrams to one or multiple instances of DSMR-reader. For detailed installation instructions, see :doc:`install guide for datalogger only<installation/datalogger>`.
nl: Je kunt een script gebruiken om in Supervisor te draaien. Deze stuurt dan telegrammen naar een of meerdere instanties van DSMR-reader. Voor volledige installatieinstructies, zie :doc:`deze handleiding voor de datalogger<installation/datalogger>`.

source: These API calls are available since ``v1.7``.
nl: Deze API-calls zijn beschikbaar sinds ``v1.7``.

source: Creates a reading from direct values, omitting the need for the telegram.
nl: Maakt een meting aan zonder het telegram op te sturen, op basis van de meegegeven waarden.

source: **Please note**: Readings are processed simultaneously. Inserting readings **retroactively** might result in undesired results due to the data processing, which is always reading ahead.
nl: **Let op**: Metingen worden gelijktijdig verwerkt. Wanneer je metingen met **terugwerkende kracht** toevoegt, kan dit leiden tot ongewenste resultaten in de dataverwerking, die altijd vooruit werkt.

source: Therefor inserting historic data might require you to delete all aggregated data using::
nl: Daarom kan het nodig zijn dat je alle geaggregeerde gegevens verwijdert met::

source: This will process all readings again, from the very first start, and aggregate them (and **will** take a long time depending on your reading count).
nl: Dit zorgt ervoor dat de applicatie alle metingen opnieuw inleest, helemaal vanaf het begin, en ze opnieuw aggregeert. Dit **zal** lang duren, afhankelijk van hoeveel metingen er opgeslagen zijn.

source: Please note that the datalogger may interfere. If your stats are not correctly after regenerating, try it again while having your datalogger disabled.
nl: N.B.: De datalogger kan soms in de weg zitten. Mocht blijken dat de statistieken niet kloppen na hergenereren, dan kun je het eventueel nogmaals proberen met de datalogger uitgeschakeld.

source: Full path: ``/api/v2/datalogger/dsmrreading``
nl: Volledig pad: ``/api/v2/datalogger/dsmrreading``

source: **[R]** = Required field
nl: **[R]** = Verplicht veld

source: **[R]** ``timestamp`` (*datetime*) - Timestamp indicating when the reading was taken, according to the smart meter
nl: **[R]** ``timestamp`` (*datetime*) - Moment waarop de meting is gedaan, volgens de meter

source: **[R]** ``electricity_currently_delivered`` (*float*) - Current electricity delivered in kW
nl: **[R]** ``electricity_currently_delivered`` (*float*) - Huidig elektriciteitsverbruik in kW

source: **[R]** ``electricity_currently_returned`` (*float*) - Current electricity returned in kW
nl: **[R]** ``electricity_currently_returned`` (*float*) - Huidige teruglevering elektriciteit in kW

source: **[R]** ``electricity_delivered_1`` (*float*) - Meter position stating electricity delivered (low tariff) in kWh
nl: **[R]** ``electricity_delivered_1`` (*float*) - Meterstand van verbruikte elektriciteit (laagtarief) in kWh

source: **[R]** ``electricity_delivered_2`` (*float*) - Meter position stating electricity delivered (normal tariff) in kWh
nl: **[R]** ``electricity_delivered_2`` (*float*) - Meterstand van verbruikte elektriciteit (piektarief) in kWh

source: **[R]** ``electricity_returned_1`` (*float*) - Meter position stating electricity returned (low tariff) in kWh
nl: **[R]** ``electricity_returned_1`` (*float*) - Meterstand van teruggeleverde elektriciteit (laagtarief) in kWh

source: **[R]** ``electricity_returned_2`` (*float*) - Meter position stating electricity returned (normal tariff) in kWh
nl: **[R]** ``electricity_returned_2`` (*float*) -Meterstand van teruggeleverde elektriciteit (piektarief) in kWh

source: ``phase_currently_delivered_l1`` (*float*) - Current electricity used by phase L1 (in kW)
nl: ``phase_currently_delivered_l1`` (*float*) - Huidig elektriciteitsverbruik in fase L1 (in kW)

source: ``phase_currently_delivered_l2`` (*float*) - Current electricity used by phase L2 (in kW)
nl: ``phase_currently_delivered_l2`` (*float*) - Huidig elektriciteitsverbruik in fase L2 (in kW)

source: ``phase_currently_delivered_l3`` (*float*) - Current electricity used by phase L3 (in kW)
nl: ``phase_currently_delivered_l3`` (*float*) - Huidig elektriciteitsverbruik in fase L3 (in kW)

source: ``phase_currently_returned_l1`` (*float*) - Current electricity returned by phase L1 (in kW)
nl: ``phase_currently_returned_l1`` (*float*) - Huidig elektriciteitteruglevering in fase L1 (in kW)

source: ``phase_currently_returned_l2`` (*float*) - Current electricity returned by phase L2 (in kW)
nl: ``phase_currently_returned_l2`` (*float*) - Huidig elektriciteitteruglevering in fase L2 (in kW)

source: ``phase_currently_returned_l3`` (*float*) - Current electricity returned by phase L3 (in kW)
nl: ``phase_currently_returned_l3`` (*float*) - Huidig elektriciteitteruglevering in fase L3 (in kW)

source: ``extra_device_timestamp`` (*datetime*) - Last timestamp read from the extra device connected (gas meter)
nl: ``extra_device_timestamp`` (*datetime*) - Tijdstip van meting door de externe (gas)meter

source: ``extra_device_delivered`` (*float*) - Last value read from the extra device connected (gas meter)
nl: ``extra_device_delivered`` (*float*) - Meterstand van de externe (gas)meter

source: **datetime format** = ``YYYY-MM-DDThh:mm[:ss][+HH:MM|-HH:MM|Z]``, i.e.: ``2017-01-01T12:00:00+01`` (CET), ``2017-04-15T12:00:00+02`` (CEST) or ``2017-04-15T100:00:00Z`` (UTC).
nl: **datetime formaat** = ``YYYY-MM-DDThh:mm[:ss][+HH:MM|-HH:MM|Z]``, bijvoorbeeld: ``2017-01-01T12:00:00+01`` (CET), ``2017-04-15T12:00:00+02`` (CEST) of ``2017-04-15T100:00:00Z`` (UTC).

source: ``HTTP 201`` on success. Body contains the reading created in JSON format. Any other status code on failure.
nl: ``HTTP 201`` wanneer succesvol. Elke andere status code bij falen. De respons bevat de aangemaakte meting in JSON-formaat.

source: **Data** to insert::
nl: **Data** te verwerken::

source: Using **cURL** (commandline)::
nl: Met **cURL** (commandline)::

source: Using **requests** (Python)::
nl: Met ``requests`` (Python)::

source: **Result**::
nl: **Resultaat**::

source: Retrieves any readings stored. The readings are either constructed from incoming telegrams or were created using this API.
nl: Haalt opgeslagen metingen op. De metingen komen ofwel voort uit telegrammen of zijn handmatig aangemaakt via deze API.

source: All parameters are optional.
nl: Alle parameters zijn optioneel.

source: ``timestamp__gte`` (*datetime*) - Limits the result to any readings having a timestamp **higher or equal** to this parameter.
nl: ``timestamp__gte`` (*datetime*) - Beperkt het resultaat tot alle (datum)tijdstippen die **hoger of gelijk zijn aan** deze parameter.

source: ``timestamp__lte`` (*datetime*) - Limits the result to any readings having a timestamp **lower or equal** to this parameter.
nl: ``timestamp__lte`` (*datetime*) - Beperkt het resultaat tot alle (datum)tijdstippen die **lager of gelijk zijn aan** deze parameter.

source: ``ordering`` (*string*) - Use ``-timestamp`` to sort **descending**. Omit or use ``timestamp`` to sort **ascending** (default).
nl: ``ordering`` (*string*) - Gebruik ``-timestamp`` om **aflopend** te sorteren. Laat de parameter weg of gebruik ``timestamp`` om **oplopend** te sorteren (standaard).

source: ``offset`` (*integer*) - When iterating large resultsets, the offset determines the starting point.
nl: ``offset`` (*integer*) - Bij het doorlopen van vele resultaten kun je hiermee het startpunt bepalen.

source: ``limit`` (*integer*) - Limits the resultset size returned. Omit for maintaining the default limit (**25**).
nl: ``limit`` (*integer*) - Beperkt het aantal resultaten dat teruggegeven wordt. Laat deze parameter weg voor de standaardwaarde (**25**).

source: ``HTTP 200`` on success. Body contains the result(s) in JSON format. Any other status code on failure.
nl: ``HTTP 200`` wanneer succesvol. Het antwoord bevat de resultaten in JSON-formaat. Geeft elke andere status code terug bij falen.

source: Example 1 - Fetch all readings
nl: Voorbeeld 1 - Haal alle metingen op

source: This demonstrates how to fetch all readings stored, without using any of the parameters.
nl: Dit toont hoe je alle opgeslagen metingen kunt ophalen, zonder gebruik te maken van de parameters.

source: Example 2 - Fetch latest reading
nl: Voorbeeld 2 - Haal de laatste meting op

source: This demonstrates how to fetch the latest reading stored. Therefor we request all readings, sort them descending by timestamp and limit the result to only one.
nl: Dit laat zien hoe je de laatst opgeslagen meting ophaalt. Hiervoor vragen we alle metingen op, sorteren deze aflopend op tijdstip en beperken het resultaat tot één.

source: Example 3 - Fetch readings by month
nl: Voorbeeld 3 - Haal alle metingen van een specifieke maand op

source: This demonstrates how to fetch all readings within a month. We limit the search by specifying the month start and end.
nl: Dit toont hoe je alle metingen van één maand kan ophalen. Hiervoor beperken we de zoekopdracht tot het begin en einde van de betreffende maand.

source: Please note that all timestamps **returned** are in **UTC (CET -1 / CEST -2)**. This is indicated as well by the timestamps ending with a 'Z' (Zulu timezone).
nl: Let op dat alle **teruggegeven** (datum)tijdstippen in **UTC (CET -1 / CEST -2)**-formaat zijn. Dit is ook te zien aan elke instantie die eindigt met 'Z' (Zulu tijdzone).

source: Full path: ``/api/v2/datalogger/meter-statistics``
nl: Volledig pad: ``/api/v2/datalogger/meter-statistics``

source: None.
nl: Geen.

source: ``HTTP 200`` on success. Body contains the data in JSON format. Any other status code on failure.
nl: ``HTTP 200`` wanneer succesvol. Het antwoord bevat de gegevens in JSON-formaat. Geeft elke andere status code terug bij falen.

source: ``timestamp`` (*datetime*) - Timestamp indicating the last update. The builtin datalogger uses the timestamp of the telegram for this.
nl: ``timestamp`` (*datetime*) - Moment waarop de laatste update is gedaan. De ingebouwde datalogger gebruikt hiervoor het tijdstip in het telegram.

source: ``dsmr_version`` (*string*) - DSMR protocol version string. Should be something like ``42`` (4.2) or ``50`` (5.0)
nl: ``dsmr_version`` (*string*) - DSMR protocol versie string. Moet iets zijn als ``42`` (4.2) of ``50`` (5.0)

source: ``HTTP 200`` on success. Body contains the updated data in JSON format. Any other status code on failure.
nl: ``HTTP 200`` wanneer succesvol. Het antwoord bevat de bijgewerkte gegevens in JSON-formaat. Geeft elke andere status code terug bij falen.

source: **Data** to update::
nl: **Data** bij te werken::

source: Retrieves any data regarding **electricity consumption**. This is based on the readings processed.
nl: Geeft gegevens terug m.b.t. **elektriciteitsverbruik**. Dit is gebaseerd op verwerkte metingen.

source: Full path: ``/api/v2/consumption/electricity``
nl: Volledig pad: ``/api/v2/consumption/electricity``

source: ``read_at__gte`` (*datetime*) - Limits the result to any records having a timestamp **higher or equal** to this parameter.
nl: ``read_at__gte`` (*datetime*) - Beperkt het resultaat tot alle (datum)tijdstippen die **hoger of gelijk zijn aan** deze parameter.

source: ``read_at__lte`` (*datetime*) - Limits the result to any records having a timestamp **lower or equal** to this parameter.
nl: ``read_at__lte`` (*datetime*) - Beperkt het resultaat tot alle (datum)tijdstippen die **lager of gelijk zijn aan** deze parameter.

source: ``ordering`` (*string*) - Use ``-read_at`` to sort **descending**. Omit or use ``read_at`` to sort **ascending** (default).
nl: ``ordering`` (*string*) - Gebruik ``-read_at`` om **aflopend** te sorteren. Laat de parameter weg of gebruik ``read_at`` om **oplopend** te sorteren (standaard).

source: **Data structure returned**::
nl: **Datastructuur**::

source: Retrieves any data regarding **gas consumption**. This is based on the readings processed.
nl: Geeft gegevens terug m.b.t. **gasverbruik**. Dit is gebaseerd op verwerkte metingen.

source: Full path: ``/api/v2/consumption/gas``
nl: Volledig pad: ``/api/v2/consumption/gas``

source: Returns the consumption of the current day so far.
nl: Geeft het verbruik (tot nu toe) van de huidige dag terug.

source: Full path: ``/api/v2/consumption/today``
nl: Volledig pad: ``/api/v2/consumption/today``

source: Returns the live electricity consumption, containing the same data as the Dashboard header.
nl: Geeft het live elektriciteitsverbruik terug, feitelijk dezelfde gegevens als rechtsbovenin het Dashboard.

source: Full path: ``/api/v2/consumption/electricity-live``
nl: Volledig pad: ``/api/v2/consumption/electricity-live``

source: **Note**: ``cost_per_hour`` is only available when you've set energy prices.
nl: **N.B.**: ``cost_per_hour`` is alleen beschikbaar wanneer je energieprijzen hebt ingesteld.

source: Returns the latest gas consumption.
nl: Geeft het meest recente gasverbruik weer.

source: Full path: ``/api/v2/consumption/gas-live``
nl: Volledig pad: ``/api/v2/consumption/gas-live``

source: **Note**: ``cost_per_interval`` is only available when you've set energy prices.
nl: **N.B.**: ``cost_per_interval`` is alleen beschikbaar wanneer je energieprijzen hebt ingesteld.

source: Retrieves any **aggregated day statistics**. Please note that these are generated a few hours **after midnight**.
nl: Haalt **geaggregeerde dagstatistieken** op. Deze worden elke dag een paar uur **ná middernacht** gegenereerd.

source: Full path: ``/api/v2/statistics/day``
nl: Volledig pad: ``/api/v2/statistics/day``

source: ``day__gte`` (*date*) - Limits the result to any statistics having their date **higher or equal** to this parameter.
nl: ``day__gte`` (*date*) - Beperkt het resultaat tot alle datums die **hoger of gelijk zijn aan** deze parameter.

source: ``day__lte`` (*date*) - Limits the result to any statistics having their date **lower or equal** to this parameter.
nl: ``day__lte`` (*date*) - Beperkt het resultaat tot alle datums die **lager of gelijk zijn aan** deze parameter.

source: ``ordering`` (*string*) - Use ``-day`` to sort **descending**. Omit or use ``day`` to sort **ascending** (default).
nl: ``ordering`` (*string*) - Gebruik ``-day`` om **aflopend** te sorteren. Laat de parameter weg of gebruik ``day`` om **oplopend** te sorteren (standaard).

source: All the :ref:`generic DSMRREADING examples <generic-examples-anchor>` apply here as well, since only the ``timestamp`` field differs.
nl: Alle :ref:`generieke DSMRREADING voorbeelden <generic-examples-anchor>` zijn hier tevens van toepassing, gezien alleen het ``timestamp`` field afwijkt.

source: Retrieves any **aggregated hourly statistics**. Please note that these are generated a few hours **after midnight**.
nl: Haalt **geaggregeerde uurstatistieken** op. Deze worden elke dag een paar uur **ná middernacht** gegenereerd.

source: Full path: ``/api/v2/statistics/hour``
nl: Volledig pad: ``/api/v2/statistics/hour``

source: ``hour_start__gte`` (*datetime*) - Limits the result to any statistics having their datetime (hour start) **higher or equal** to this parameter.
nl: ``hour_start__gte`` (*datetime*) - Beperkt het resultaat tot alle (datum)tijdstippen die **hoger of gelijk zijn aan** deze parameter.

source: ``hour_start__lte`` (*datetime*) - Limits the result to any statistics having their datetime (hour start) **lower or equal** to this parameter.
nl: ``hour_start__lte`` (*datetime*) - Beperkt het resultaat tot alle (datum)tijdstippen die **lager of gelijk zijn aan** deze parameter.

source: ``ordering`` (*string*) - Use ``-hour_start`` to sort **descending**. Omit or use ``hour_start`` to sort **ascending** (default).
nl: ``ordering`` (*string*) - Gebruik ``-hour_start`` om **aflopend** te sorteren. Laat de parameter weg of gebruik ``hour_start`` om **oplopend** te sorteren (standaard).

source: Returns the version of DSMR-reader you are running.
nl: Geeft terug welke versie van DSMR-reader je momenteel draait.

source: Full path: ``/api/v2/application/version``
nl: Volledig pad: ``/api/v2/application/version``

source: Returns the status of DSMR-reader, containing the same data as displayed on the Status page.
nl: Geeft de status van DSMR-reader terug, vergelijkbaar aan de gegevens die getoond worden op de Status-pagina.

source: Full path: ``/api/v2/application/status``
nl: Volledig pad: ``/api/v2/application/status``
