Repository: AbelLykens/dsmr-reader
Catalog: docs/locale/*/LC_MESSAGES/intro.po
Languages: nl

source: Introduction
nl: Introductie

source: Project goals
nl: Projectdoelen

source: Provide a tool to easily extract and store data transferred by the DSMR protocol of your smart meter.
nl: Een tool aanbieden waarmee je eenvoudig gegevens uit je slimme meter via het DSMR-protocol uitleest en opslaat.

source: Allowing to export your data to other systems or third parties. It's your data, you decide.
nl: Sta toe om jouw gegevens te exporteren naar andere systemen of derde partijen. Het zijn jouw gegevens, dus jij beslist.

source: Features
nl: Mogelijkheden

source: DSMR-reader has the following features:
nl: DSMR-reader heeft de volgende mogelijkheden:

source: Read telegram data from serial port
nl: Telegrammen uitlezen van een seriÃ«le poort

source: Read telegram data from network socket
nl: Telegrammen uitlezen van een netwerksocket

source: Receive telegram data through its (REST) API
nl: Telegrammen ontvangen via de eigen (REST) API

source: Process, store and plot telegram data extensively
nl: Verwerken, opslaan en uitgebreid weergeven van gegevens uit telegrammen

source: Daily cost indication using your energy prices
nl: Indicatie van dagelijkse kosten op basis van je energietarieven

source: Push notifications through Pushover / Prowl
nl: Pushnotificaties via Pushover / Prowl

source: Automated export to your MinderGas.nl account
nl: Automatische export naar je MinderGas.nl-account

source: Automated export to your PVOutput.org account
nl: Automatische export naar je PVOutput.org-account

source: Automated export to an MQTT broker
nl: Automatische export naar een MQTT broker

source: Automated export to an InfluxDB
nl: Automatische export naar een InfluxDB

source: Automated backup to Dropbox
nl: Automatische back-up naar Dropbox

source: Automated backup through email
nl: Automatische back-up per e-mail

source: And many others...
nl: En nog vele andere....

source: Languages
nl: Talen

source: The entire application and its code is written and documented in English. The interface is translated into Dutch and will be enabled automatically, depending on your browser's language preference.
nl: De gehele applicatie, en bijbehorende code, is in het Engels geschreven. De grafische interface is echter ook in het Nederlands beschikbaar. Deze wordt automatisch getoond, afhankelijk van de taalinstelling in je webbrowser.

source: Support for:
nl: Ondersteuning voor:

source: English
nl: Engels

source: Dutch
nl: Nederlands

source: Hardware requirements
nl: Hardwarevereisten

source: For datalogger only: **Any** RaspberryPi or similar
nl: Voor alleen-datalogger: **Elke** RaspberryPi of vergelijkbaar

source: For full DSMR-reader: **RaspberryPi 3+** or similar
nl: Voor volledige DSMR-reader: **RaspberryPi 3+** of vergelijkbaar

source: P1 telegram cable (or a network socket when using ``ser2net``)
nl: Kabel voor uitlezen P1-poort (of een netwerksocket via bijvoorbeeld ``ser2net``)

source: Software requirements
nl: Softwarevereisten

source: OS: ``Raspbian OS`` or similar
nl: OS: ``Raspbian OS`` of vergelijkbaar

source: Disk space: `1+ GB` (depends on whether you archive all readings)
nl: Schijfruimte: `1+ GB` (afhankelijk van gearchiveerde metingen)

source: Python: `3.6` or higher
nl: Python: ``3.6`` of hoger

source: Smart Meter DSMR versions: `v2` / `v4` / `v5`
nl: Slimme meter DSMR versies: `v2` / `v4` / `v5`

source: Support for ``Python 3.3`` has been **discontinued** since ``DSMR-reader v1.5``
nl: Ondersteuning voor ``Python 3.3`` is **vervallen** sinds ``DSMR-reader v1.5``

source: Support for ``Python 3.4`` has been **discontinued** since ``DSMR-reader v2.0``
nl: Ondersteuning voor ``Python 3.4`` is **vervallen** sinds ``DSMR-reader v2.0``

source: Support for ``Python 3.5`` has been **discontinued** since ``DSMR-reader v3.0``
nl: Ondersteuning voor ``Python 3.5`` is **vervallen** sinds ``DSMR-reader v3.0``

source: The dashboard displays the latest information regarding the consumption of today. You can view the total consumption for current month as well. The graphs can be zoomed and display data up to the last 24 hours.
nl: Het dashboard weergeeft de meeste actuele informatie over je verbruik vandaag. Je kunt hier ook het totale verbruik van de huidige maand zien. Alle grafieken kunnen uitgezoomd worden en weergegeven gegevens tot 24 uur geleden.

source: If your meter supports it, you can also see your gas consumption and electricity returned.
nl: Je ziet hier ook je gasverbruik en teruglevering elektriciteit, mits je meter dat ondersteunt.

source: Live graphs
nl: Live grafieken

source: The live graphs plots the most recent data available, depending on the capabilities of your smart meter.
nl: De Live Grafieken pagina toont de meest recente beschikbare gegevens, afhankelijk van de mogelijkheden van je slimme meter.

source: Archive
nl: Archief

source: The archive allows you to scroll through all historisch data captured by the application. All data can be viewed on different levels: by day, by month and by year.
nl: In het archief kun je door alle historische data heen bladeren. Je kunt de gegevens bekijken op dag-, maand- of jaarbasis.

source: Compare
nl: Vergelijken

source: This page allows you to simply compare two days, months or years with each other. It will also display the difference between each other as a percentage.
nl: Deze pagina stelt je in staat om simpleweg twee dagen, maanden of jaren met elkaar te vergelijken. Daarnaast worden de verschillen tussen de twee weergegeven als percentage.

source: This page displays a summary of your average daily consumption and habits.
nl: Deze pagina weergeeft een samenvatting van je dagelijkse verbruik en gewoontes.

source: Statistics
nl: Statistieken

source: This page displays your meter positions and statistics provided by the DSMR protocol. You can also find the number of readings stored and any excesses regarding consumption.
nl: Deze pagina weergeeft je huidige meterstanden en statistieken volgens het DSMR-protocol. Je kunt hier ook het totaal aantal opgeslagen metingen vinden, evenals excessief verbruik.

source: Energy contracts
nl: Energiecontracten

source: Summary of all your contracts and the amount of energy consumed/generated.
nl: Overzicht van al je energiecontracten en het bijbehorende verbruik.

source: This pages allows you to export all day or hour statistics to CSV.
nl: Deze pagina staat je toe om alle uur- en dagstatistieken te exporteren naar CSV.

source: About
nl: Over

source: Shows the 'health' of the application and provides a lot of background information.
nl: Toont de status van de applicatie en verwijst naar een hoop achtergrondinformatie.

source: You can also easily check for DSMR-reader updates here.
nl: Je kunt hier eveneens eenvoudig controleren op updates van DSMR-reader.

source: Configuration
nl: Configuratie

source: The configuration page is the entrypoint for the admin interface.
nl: De configuratiepagina is de toegangspoort tot het adminportaal.

source: You can type any topic or setting you're searching for, as it should pop up with clickable deeplink to the admin panel. Or you can just skip it this page and continue directly to the admin panel.
nl: Je kunt hier elk onderwerp of instelling waarnaar je op zoek bent intypen, om vervolgens een popup te krijgen met een klikbare link direct naar het juiste onderdeel binnen het adminportaal.
